# encoding: utf-8

# строка имеет метод length, который возвращает кол-во символов в строке
puts "я объект типа строка!".length

# целое число имеет метод to_f, который возвращает это же число, но превращенное
# в другой тип "вещественное число"
puts 17.to_f

# PS:
# о том чем целые числа отличаются от вещественных
# (почему это разные типы объектов) смотри:
# http://ru.wikipedia.org/wiki/Вещественные_числа
# http://ru.wikipedia.org/wiki/Целое_число

# Описание класса Строка и доступных свойств из документации Руби 2.0:
# http://www.ruby-doc.org/core-2.0/String.html

# Описание свойств класса целых чисел:
# http://www.ruby-doc.org/core-2.0/Fixnum.html

# Описание вещественных чисел (т. н. с плавающей точкой)
# http://www.ruby-doc.org/core-2.0/Float.html
